/**
 * @file FSM_Key.cpp
 * @author Oyyp(2577468184@qq.com)
 * @brief 仿造刘神的状态机写法，评鉴一下
 * @version 0.1
 * @date 2026-09-18 0.1 init
 *
 * @copyright Copyright HUNAU-Robot(c) 2026
 *
 */
/* Includes ------------------------------------------------------------------*/
#include "FSM_Key.h"


/* Private macros ------------------------------------------------------------*/

/* Private types -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private function declarations ---------------------------------------------*/

/* Function prototypes -------------------------------------------------------*/

